[
  {
    "name": {
      "ru": "Калькулятор",
      "eng": "Calculator"
    },
    "text": {
      "ru": "Это мой первый проект на typescript и я его сделал в учебных целях.",
      "eng": "This is my first typescript project and I created it for training."
    },
    "date": "2022-03",
    "img": "calculatorts",
    "img_big": "calculatorts",
    "link": "calculatorts/index.html",
    "addLinks": {
      "git": "https://github.com/Arteben/calculatorts"
    }
  },
  {
    "name": {
      "ru": "Портфолио",
      "eng": "Profile"
    },
    "text": {
      "ru": "Этот проект разрабатывался для презентации моих профессиональных навыков и моих работ.  Он написан на vue2, с использованием библиотеки vuetify. Этот проект был создан два года назад и время от времени немного доделывается.",
      "eng": "This project was created to present my professional skills and my works. It has written with the vue2 library and the vuetify. This project was created two years ago and has been developed a bit since then."
    },
    "date": "2022-03",
    "img": "myprofile",
    "img_big": "myprofile",
    "addLinks": {
      "git": "https://github.com/Arteben/my-profile"
    }
  },
  {
    "name": {
      "ru": "Гоночки",
      "eng": "Races"
    },
    "text": {
      "ru": "Аркадная гонка. Если прийти к финишу не последним, то на сервер сохранится этот результат. Реализовано с помощью playgraund.js и raphael.js. Все элементы игры отображены с помощью SVG. На телефонах не работает.",
      "eng": "This is an arcade race. If you do not reach the finish line last, then this result will be saved to the server. Implemented with playgraund.js and raphael.js. All elements of the game are displayed with SVG. Doesn't work on smartphones."
    },
    "date": "2017-06",
    "img": "races",
    "img_big": "races",
    "link": "races\/index.html",
    "addLinks": {
      "git": "https://github.com/Arteben/races",
      "habr": "https://habr.com/en/post/331430/"
    }
  },
  {
    "name": {
      "ru": "Линии",
      "eng": "Lines"
    },
    "text": {
      "ru": "Цель - отметить все точки на игровом поле за выделенное время. Использованные библиотеки: raphael.js и playgraund.js",
      "eng": "The goal is to mark all points on the playing field for the allowed time. Libraries used: raphael.js and playground.js"
    },
    "date": "2017-01",
    "img": "lines",
    "img_big": "lines",
    "link": "lines\/index.html"
  },
  {
    "name": {
      "ru": "Чичиве",
      "eng": "Chichive"
    },
    "text": {
      "ru": "Настольная игра, в которой игроки по очереди бросают кубик(здесь крутят рулетку). Если выпала шестерка (стрелка указала на шесть точек), то игрок может поставить новую фишку. Побеждает тот, кто первым проведет по всему полю четыре фишки. Игрок играет за «Reds», остальными игроками управляет AI.",
      "eng": "A board game when players throw dice (roulette is spinning here). If a six has fallen (the arrow points to six dots), then the player can put a new chip. The first player to swipe four chips across the board wins. The player plays for the Reds, other players are controlled by AI."
    },
    "date": "2015-06",
    "img": "chichive",
    "img_big": "chichive",
    "link": "chichive\/index.html"
  },
  {
    "name": {
      "ru": "Рэндзю",
      "eng": "Renju"
    },
    "text": {
      "ru": "Моя реализация рэндзю (крестиков-ноликов на большом поле) с алгоритмом, который находит ходы методом перебора.",
      "eng": "This is my renju realisation (tic-tac-toe on a large field). The AI find moves with a brute-force search algorithm."
    },
    "date": "2014-01",
    "img": "nac",
    "img_big": "nac",
    "link": "nac\/index.html",
    "addLinks": {
      "git": "https://github.com/Arteben/noughtscrossesjs",
      "habr": "https://habr.com/en/post/209544/"
    }
  },
  {
    "name": {
      "ru": "Уголки",
      "eng": "Сorners"
    },
    "text": {
      "ru": "Эта настольная игра использует технологию динамического DOM и библиотеку jquery.",
      "eng": "This board game uses dynamic DOM and the jQuery library."
    },
    "date": "2011-08",
    "img": "corners",
    "img_big": "corners",
    "link": "corners\/index.html",
    "addLinks": {
      "git": "https://github.com/Arteben/CornersJS",
      "habr": "https://habr.com/en/post/184726/"
    }
  },
  {
    "name": {
      "ru": "Пятнашки",
      "eng": "Game of Fifteen"
    },
    "text": {
      "ru": "Игра пятнашки. Реализация с возможностью вращения фишек (игрового поля), так что тут нет проигрышных комбинаций. Используется библиотека jquery.",
      "eng": "This is almost a classical game of Fifteen. The playing field can turn over and therefore there are no win-win situations. There is jQuery library used."
    },
    "date": "2015-04",
    "img": "tag",
    "img_big": "tag",
    "link": "tag\/index.html"
  }
]